[
  {
    "companyName": "Xing",
    "startEndDate": "Started at: 09/2021",
    "description": "is part of New Work SE group. It’s the largest job matcher application in Germany. At Xing I was part of the content team and had the pleasure to work close to a senior engineer with over 10 years' experience in software development who was like a mentor to me for about one year. After that I was in a multidisciplinary team as the only android engineer, responsible for the app modules related to content and companies' pages.\nI also worked on platform team related tasks created at our kaizen board, helping the android community (about 30 engineers) to improve our codebase.\nI was part of the compose migration task force and helped migrating some features from my team and for other teams.\nDuring my time at Xing I joined a group that was created with the purpose of rethinking the “android engineer hiring tunnel”. After getting insights from the other engineers and organizing ideas, we successfully designed an innovative approach for the process.",
    "subitems": []
  },
  {
    "companyName": "Celfocus IT Services and Consulting.",
    "startEndDate": "04/2019 – 08/2021",
    "subitems": [
      {
        "companyName": "Du Telecom (telecom company from Dubai).",
        "projectName": "Project: Digital Catalog",
        "startEndDate": "04/2019 – 08/2021",
        "description":"I participated in the creation of a digital catalog to perform devices comparison, presenting all the devices characteristics and specifications to help clients to decide which device fits their needs better. The app was created to be used on tablets at Du stores and was meant to work “offline” the catalog was updated once a day synchronizing with a remote Omnichannel\nFor this project we were a team of two android developers, the app was created from scratch and delivered on time."
      },
      {
        "companyName": "Vodafone Portugal (Telecom company).",
        "projectName": "Project: Smart Router",
        "startEndDate": "06/2021 – 07/2021",
        "description": "SSmart Router is an app dedicated to managing internet contracts and routers linked to those contracts at distinct locations. My participation on this project was brief, related to security and implementing reCAPTCHA. I also made other smaller improvements: some api request changes, adding a new router configuration page and updating the splash screen."
      },
      {
        "companyName": "Bankinter Portugal (bank corporation).",
        "projectName": "Project: Mock app",
        "startEndDate": "05/2021 – 07/2021",
        "description": "The Bankinter app was ready (developed by other team in Lisbon) and there was a request to have a version of the app with couple of mocked flows to allow performing fake transactions, for example, creating a new account and generating a token to authorize some bank operation."
      },
      {
        "companyName": "Vodafone Qatar (telecom company).",
        "projectName": "Projects: My Vodafone App | Chatbot (parallel project inside My Vodafone App)",
        "startEndDate": "04/2019 – 01/2021",
        "description": "My Vodafone App is an “one stop shop” app. The app allows the clients to manage a variety of contracts (tv, cable/fiber internet, telephone, data package). We implemented payment modules, packs and plans customization, find a store (on maps), etc.\nI was one of the 5 android developers involved in this project. We created the whole app from scratch, and it was fully released on time to the client."
      }
    ]
  }
]
